Hey @dglsparsons , thanks for looking into this further! Sure:

Result when no changes need to be applied is as expected (no changes)
```
Sjoerd van Bommel@DESKTOP-MQ2G6VR MINGW64 /c/workspace/personal/monorepo/packages/swipe-script/infra (staging)
$ terraform apply
aws_security_group.mr-ss-security-group: Refreshing state... [id=sg-0cdf1d38d577a091b]
aws_db_instance.mr-ss-db-instance: Refreshing state... [id=db-B2NR6JRYJ6OAK7PNHB7YT75JOQ]
vercel_project.mr-ss_web: Refreshing state... [id=prj_I60vOHrTCjRSah7yH0mdepUy62bT]
vercel_project_domain.mr-ss_web-staging-domain: Refreshing state... [id=swipe-script-staging.vercel.app]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

Result of `terraform plan` when I changed any property, like `install_command`:

```
$ terraform plan
aws_security_group.mr-ss-security-group: Refreshing state... [id=sg-0cdf1d38d577a091b]
aws_db_instance.mr-ss-db-instance: Refreshing state... [id=db-B2NR6JRYJ6OAK7PNHB7YT75JOQ]
vercel_project.mr-ss_web: Refreshing state... [id=prj_I60vOHrTCjRSah7yH0mdepUy62bT]
vercel_project_domain.mr-ss_web-staging-domain: Refreshing state... [id=swipe-script-staging.vercel.app]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # vercel_project.mr-ss_web must be replaced
-/+ resource "vercel_project" "mr-ss_web" {
      ~ environment                             = (sensitive value)
      ~ id                                      = "prj_I60vOHrTCjRSah7yH0mdepUy62bT" -> (known after apply)
      ~ install_command                         = "pnpm i" -> "pnpm install"
        name                                    = "swipe-script"
      + protection_bypass_for_automation_secret = (known after apply)
      + team_id                                 = (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # vercel_project_domain.mr-ss_web-staging-domain must be replaced
-/+ resource "vercel_project_domain" "mr-ss_web-staging-domain" {
      ~ id         = "swipe-script-staging.vercel.app" -> (known after apply)
      ~ project_id = "prj_I60vOHrTCjRSah7yH0mdepUy62bT" # forces replacement -> (known after apply) # forces replacement
      + team_id    = (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

I also tested it with other properties like `serverless_function_region`, `root_directory`, and the environment variable. I see it's trying to add a `team_id` which you did specify. Could this be related?